{
    "title": "A City of Sadness",
    "year": "",
    "description": "The story of a family embroiled in the “White Terror,” the Kuomintang government’s anti-communist political repression that was wrought on the Taiwanese people from 1947-1987.",
    "average_rating": "4.1",
    "rating_count": "13616",
    "poster_url": "https://a.ltrbxd.com/resized/film-poster/1/5/6/5/1/15651-a-city-of-sadness-0-1000-0-1500-crop.jpg?v=96893fa78f",
    "rating_distribution": {
        "20 half-★": 20,
        "51★": 51,
        "66★": 66,
        "177★": 177,
        "244★": 244,
        "1,047★": 1047,
        "1,762★": 1762,
        "4,208★": 4208,
        "2,656★": 2656,
        "3,385★": 3385
    },
    "reviews_url": "https://letterboxd.com/film/a-city-of-sadness/reviews/by/activity/",
    "reviews": [
        {
            "username": "colonelmortimer",
            "rating": "★★★★",
            "date": "2015-03-27",
            "review": "Unable to hear or speak, or scarred by war, or exiled from home, everyone is scattered and none of these characters is exactly whole. Entire generations now fundamentally incapable of just being.",
            "likes": 341
        },
        {
            "username": "astardoc",
            "rating": "★★★★★",
            "date": "2021-05-14",
            "review": "An era of sadness. A broken family's pain mirroring that of the country's. Deaf or dead, disabled or disappeared, this pain of being passed around as nothing more than a piece of land haunts their entire existence. Being colonised by one empire and then handed over to another, with the people who live in it being reduced to mere subjects; the old brand of suppression has been replaced by a new one. The perpetual beauty of Taiwan's landscape ruthlessly contrasts… \nmore",
            "likes": 268
        },
        {
            "username": "darrencb",
            "rating": "★★★★½",
            "date": "2020-02-15",
            "review": "3000 Followers Celebration\nPicked by: \nKosta Jovanović\n and \nsciallacooper\n.\nPolitics. Change. Fear and chaos. Trauma. Disability. Hou Hsiao-hsien's \nA City of Sadness\n just captures the passage of time, using it to outline an entire history. Like Zhang Yimou's \nTo Live\n and Edward Yang's \nA Brighter Summer Day\n, there's something perfectly reflexive about these early 90s simple retellings of mid-century China and Taiwan. \nA City of Sadness\n covers tumultuous history, namely the White Terror and commencement of martial law in Taiwan.… \nmore",
            "likes": 168
        },
        {
            "username": "theendofcinema",
            "rating": "★★★★★",
            "date": "2018-09-02",
            "review": "Reminded me this time not only of A Brighter Summer Day, in many ways its perfect companion and counterpoint, but also of Fort Apache and 8 Diagram Pole Fighter. A generation of men wiped out and driven mad, with only the women left to carry on and tell their story.",
            "likes": 161
        },
        {
            "username": "goliathreturns",
            "rating": "★★★★★",
            "date": "2020-04-17",
            "review": "Hou Hsiao-hsien’s historical epic is grounded in a particular moment of Taiwanese history, the Chinese Nationalist Party authoritarian transgressions after its 1945 appropriation of Taiwan and the primary incident of a slaughtering of thousands of people in 1947 known as the February 28 incident. However, this is not a directly political film; it's a decidedly restrained work with its interests resting with the Lin family and with how the nationwide circumstances touched their lives, and it masterly accomplishes illustrating the… \nmore",
            "likes": 117
        },
        {
            "username": "theportman",
            "rating": "★★★★½",
            "date": "2021-06-09",
            "review": "A city of sadness. A city of crime and despair, and hope. A land in turmoil with an uncertain future. While initially centred on the events and emotions of post-war Taiwan, Hou Hsiao-hsien's sprawling epic covers an awful lot of ground to deliver a meaningful and compassionate perspective on the long and proud heritage of this nation.\n\"The light has come on again. At last.\"\nNot simply a political retelling or a jab at at the ruling powers of the… \nmore",
            "likes": 96
        },
        {
            "username": "filipe_furtado",
            "rating": "★★★★½",
            "date": "2024-06-03",
            "review": "Less intimate perhaps, but more wide raging than A Time to Live and a Time to Die. It is more obvious symbolic, the historical period, the brothers, the way art and language function inside it, but it also makes a lot out of Hou’s emphasis on gestures and reactions to the big events, historical and emotional, around the characters. It makes sense it won the Golden Lion that year despite Hou not quite being an acknowledged master at the time, as its importance feel as apparent as its greatness.",
            "likes": 96
        },
        {
            "username": "will_sloan",
            "rating": "",
            "date": "2021-05-28",
            "review": "Wen-heung is Groucho, Wen-ching is Harpo, Wen-leung is Chico, and the brother who disappeared during the war is Zeppo. Hope this is helpful to any western viewers confused by some of the nuances of Taiwanese history.",
            "likes": 94
        },
        {
            "username": "juliendonkeyboi",
            "rating": "★★★★½",
            "date": "2020-06-25",
            "review": "\"In life I was separated from the fatherland. In death, I return.\" \nHou Hsiao-Hsien encapsulates decades of despair into one film that, rather than narrowing in on the grand moments, chronicles familial experiences following Japan's period of colonial rule in Taiwan. It's a masterful exploration of the connection between the personal and the historical, and a powerful portrait of an oppressive government increasingly marked by corruption. One of the most emotionally complex historical tragedies ever made.",
            "likes": 82
        },
        {
            "username": "marcissus",
            "rating": "★★★★",
            "date": "2022-02-23",
            "review": "It's easy to get lost in a history unfamiliar, every time i watch this i struggle with its momentum and deep searing sadness, it certainly does a good job of making your bones ache, making your face hang low. however i will be putting this back into the \"once a decade\" folder. you know a movie is mistreated when you're watching the same shitty rip you did ten years ago. Get it together Criterion",
            "likes": 79
        },
        {
            "username": "vadekawa",
            "rating": "★★★★★",
            "date": "2015-09-30",
            "review": "While seeing \nThe Assassin\n on last Friday, I realized a thing that I've known for a long time (but never really thought). Hou doesn't follow classic structure at all. These films don't really have any high points and they never really end - some never really start but \nA City of Sadness\n isn't one of them. Hou follows the structure of life, structure of history and I'd say that this structure he obeys might be more cinematic than anything else.… \nmore",
            "likes": 78
        },
        {
            "username": "pudgymccabe",
            "rating": "★★★★",
            "date": "2022-09-21",
            "review": "Ellipses viewed through entryways and exits that lead to nothing, nowhere.\nWar breeds loss, and it lingers in every corner of every room in every home bound by borders that harbor nations; the malignant residual cost of nationalist conflicts. Evil spreads pernicious seeds along its pitted path of total domination. These dark, deceitful seeds will grow to appear prosperous, at least, that’s the line they claim. Yet this persecutory command leaves families and country one and the same to fall in pieces like pinkish-white petals of dying blossoms.\nNot the beginning, nor the end…",
            "likes": 72
        }
    ]
}