[{"Reviewer":"David Chen","Rating":4.5,"Date":"2021-12-10T05:29:47.138Z","Content":"You know this shit is good when they don't drop the opening credits on you until 40 minutes in. Sorry, it's just a golden rule of movies.","Likes":10798},{"Reviewer":"demi adejuyigbe","Rating":null,"Date":"2022-02-21","Content":"my therapist likes to stop me whenever i criticize myself with the word ‘should,' that i should feel some way, that i should have done something. we stop and dig into this statement until i get to the root of it and try to understand how i've internalized whatever idea or feeling or action is meant to be \"correct\" or \"normal.\" it's a hard thing for me to do because it's always easiest to lightly lean on myself as the… more","Likes":8633},{"Reviewer":"Patrick Willems","Rating":4.5,"Date":"2022-01-03","Content":"I know there’s way more important stuff here but I have to point out that the 2-door red Saab is one of the best movie cars I’ve ever seen. Just a truly excellent car. Lots of character.","Likes":7387},{"Reviewer":"David Sims","Rating":5.0,"Date":"2022-01-16","Content":"smokin cigs out the sunroof together","Likes":5749},{"Reviewer":"Chris Evangelista","Rating":4.0,"Date":"2021-12-13","Content":"That shot of the two of them holding their cigarettes up through the sunroof is an all-timer.","Likes":5182},{"Reviewer":"Josh Lewis","Rating":4.0,"Date":"2021-09-15","Content":"“Those who survive keep thinking about the dead.”\n“What can we do? We must live our lives.”","Likes":4519},{"Reviewer":"Ayush","Rating":5.0,"Date":"2021-10-03","Content":"People spend their whole lives forming bonds with each other. Some of those bonds are permanent, others fleeting. Some bonds simply do not last at all, others only get stronger over time, while some unfortunately have the sour luck of hanging by a thread while slowly crumbling like walls subjected to acid rain. Rarely does a relationship remain unchanged throughout its course.\nThis dynamic nature of relationships is fueled entirely by people going through trials and tribulations with each other… more","Likes":3427},{"Reviewer":"Sophy","Rating":null,"Date":"2021-12-08","Content":"About 20 minutes before the film ends there is a momentary collapse of all sounds. I don't think I've ever heard silence quite like it. I could hear my heart throbbing in my ears -- a painful sting coupled with a quiet panic as my senses became temporarily heightened and numbed all at once. A brief glimpse into passing?\nYeah, pretty great film.","Likes":2913},{"Reviewer":"James (Schaffrillas)","Rating":4.5,"Date":"2022-03-23T20:41:07.891Z","Content":"\"It didn't sound like he was lying. I don't know if it's the truth, but he was telling you what was true to him.\"\nFucking hell this destroyed me emotionally. A rather unwieldy slow burn that didn't fully grab me at first, but as the story progressed it revealed the necessity of every seemingly irrelevant detail in the first half. I went from thinking \"Yeah it's a good movie that needed to shave down that 40 minute prologue\" to \"Holy… more","Likes":2771},{"Reviewer":"Framesofnick","Rating":4.5,"Date":"2022-03-24","Content":"How the fuck is this nominated in the same category as Don’t Look Up for the Oscar’s","Likes":2356},{"Reviewer":"Ethan Ethan","Rating":5.0,"Date":"2021-12-02","Content":"\"How's the movie?\"\n\"It's fabulous. The movie paced so smoothly, I hardly feel the runtime. I even forgot I'm watching a movie. I've watched many movies, but it's never been so pleasant.\"","Likes":2204},{"Reviewer":"Matt Neglia","Rating":4.5,"Date":"2021-12-18","Content":"Can any of us ever perfectly understand another person? However much we may love them?\n\nIt’s all there in the text.","Likes":1875}]