[{"Reviewer":"zander","Rating":1.5,"Date":"2024-04-18","Content":"Weren’t they supposed to come out of the closet after only a few minutes are they alright in there has anyone checked on them","Likes":9},{"Reviewer":"daytv","Rating":1.0,"Date":"2025-03-20","Content":"personally i love a movie that doesn’t know what it is","Likes":5},{"Reviewer":"carolineb2226","Rating":2.0,"Date":"2025-03-20","Content":"Loved that one part when they forgot what genre the movie was. i'll put that in my presentation.","Likes":2},{"Reviewer":"crtr","Rating":4.0,"Date":"2024-03-26","Content":"Touching! & surprised me with how funny and lighthearted it was at times","Likes":2},{"Reviewer":"Tyler","Rating":3.5,"Date":"2024-03-26","Content":"“Please stow away your emotions, we’re about to land”\n\nI think a lot of the comedic moments get lost in cultural translation, but the emotion still sticks.","Likes":2},{"Reviewer":"austinyang","Rating":3.0,"Date":"2023-11-09","Content":"《父後七日》（2023\/11\/09）6\n沒有很喜歡這部片。也許是原本期待太高，總之沒有我想像中那麼好看。劇情面有些散漫，前後常常無法連貫，讓人看得摸不著頭緒。比如我，中間就恍神了很多次。另外不太喜歡這部片的色彩，偏黃色調，讓人看了昏昏欲睡，只能說它很不討好我。\n但是這部片提及的一些細節的確有觸動到我。比如過世之後的七日內，必須要做各種繁瑣儀式，簡直讓人沒有時間沈澱自己的情緒、好好悼念逝去的親人——不禁讓我想到當時奶奶過世的場景。我是等到好一陣子之後才哭得出來，當下，根本無法哭，也並沒有很難過，只是覺得疲憊。這部份電影倒是刻劃得很細膩。","Likes":2},{"Reviewer":"chiaayii","Rating":2.5,"Date":"2023-10-23","Content":"角色各自的故事模糊不清\n導致情感層面難以說服觀眾\n還有風格強烈的調色，但好像也沒有更助於敘事\n幹嘛對沒有人的夜市叫賣！","Likes":2},{"Reviewer":"summer","Rating":3.0,"Date":"2024-03-13","Content":"不好意思我全電影還沒看：（","Likes":1},{"Reviewer":"achenii","Rating":4.0,"Date":"2019-12-17","Content":"看的時候不斷想起夏宇<野餐—給父親>:「無掛礙故, 無有恐怖.」從此, 你在多風的地方獨自野餐; 而我, 在人潮洶湧之中, 那麼一刻, 驚覺你的離去, 竟使我哭了起來. 如果我一直惦記, 也許就不那麼懦弱.【她一邊哭一邊滿嘴是飯的時候, 居然讓我知道如何同時又哭又笑】","Likes":1},{"Reviewer":"brennteiskalt","Rating":3.5,"Date":"2013-04-14","Content":"在自散文改编成的电影中，《父后七日》并不是最好的。这体现在它不经济的镜头感和不纯熟的文学情调处理上。然而它依旧是部相当让人惊喜的电影，它成功的唤起了几乎每个人都有的相似体悟，而且很聪明地把它不紧不慢地抻到结尾。于是那些甚是折腾的丧葬仪式居然也可爱了起来，悠悠然让人最后若有所失。","Likes":1},{"Reviewer":"maxanonymous","Rating":2.0,"Date":"2019-03-27","Content":"a touching look at familial relationships and an interesting lesson on traditional taiwanese funerary rites.\nhowever, the style was all over the place and the film needed a lot of refining. had a very made-for-tv vibe","Likes":1},{"Reviewer":"vicli","Rating":4.5,"Date":"2018-06-23","Content":"This film is surprisingly heartwarming and funny. Not only does it portray the traditions of daoism and Taiwan in an endearing light, it was the perfect combination of laugh-out-loud ridiculousness and quiet statements about love and family, taildoved by a truly perceptive and witty screenplay. I felt as if I were a sibling of the two young people who’s father had just passed. I went through seven days of rituals, dealings with families and friends, and occasional flashbacks to memories… more","Likes":1}]