[{"Reviewer":"Will Sloan","Rating":null,"Date":"2024-09-05","Content":"The freewheeling mix of documentary and archival footage, repurposed deleted scenes from previous Jia productions, and new COVID-era drama conveys a sense of time and space\/past and present collapsing in a modern China that is still always moving forward, forward, forward. Feels like Jia discovering cubism. Pretty incredible.\nWhat does Jia think of the COVID protocols? The Beijing Olympic bid? Tour boats on the Yangtze? Robot waiters? Like a good therapist, he just finds them all interesting.","Likes":465},{"Reviewer":"Neil Bahadur","Rating":5.0,"Date":"2024-09-06","Content":"More on this, I hope, to come - since this is already a movie that’s deeply ingrained itself in my thoughts, and one that I already very much adore. A wonderfully creative (and innovative!) abstract masterpiece, though so much of it - primarily it's central conceit - I still struggle to articulate, yet now having seen it multiple times I've found my favorite section changing each time. Its impressionistic narrative structure consisting of documentary and not, deleted scenes from old… more","Likes":396},{"Reviewer":"esther","Rating":5.0,"Date":"2024-10-08","Content":"for jia, to age is to become dignified but uncool. strangely apropos that his images actually get less wrinkly as time passes. on a long enough timescale, everything seedy and jagged becomes classy and smooth. zhao tao is one of the most captivating screen presences of all time. she's like the mona lisa, you seem to always be able to see the gears turning in her head (the film gets one of its best gags out of her enigmatic expressions).… more","Likes":307},{"Reviewer":"reibureibu","Rating":5.0,"Date":"2024-12-10","Content":"“I was twenty-three years old when I enrolled in the Beijing Film Academy. Most of my classmates were teenagers who had just graduated from high school, and I was five years older. Unlike them, I had no time to lose. For me, it was the end of being carefree. For them, life still had all its freshness but I already felt old. In the evening, my favorite place to be was the study room where we could smoke. I would…\nmore","Likes":82},{"Reviewer":"comrade_yui","Rating":5.0,"Date":"2024-10-15","Content":"a talismanic film found beneath the digital trash-stratum, coordinated somewhere between a chopped & screwed wang bing doc, a late-godard domestic remix, and an arthur lipsett pop music video -- which is to say it's another masterwork from one of cinema's brightest souls, essential viewing for what the medium must become, hell or high water -- no exaggeration, no hyperbole needed: if you're not on this wavelength, you're simply doing yourself a disservice.\na silent zhao tao chases after li zhubin's… more","Likes":230},{"Reviewer":"Filipe Furtado","Rating":3.5,"Date":"2024-10-25","Content":"More than just reusing footage that belong to early shoots, this feels like a more ample rethinking of a lot of strands of Jia’s drama and aesthetic strategies as they relate to China as a whole. A fascinating auteurist object, even more so because it does look forward. Ingenuous conceived, if not always successful, a reminder that his eye is consistently great and that Zhao Tao is one of film’s most compelling presences.","Likes":226},{"Reviewer":"Brandon Streussnig","Rating":5.0,"Date":"2025-05-06","Content":"The way Jia tracks time via handheld mini DV to robotic security cam footage is truly astonishing. Decades traversed through a digital void where memories are pixelated and fragmented. That transition from the aerial view of the ballroom into the grocery store oranges may be the single greatest moment in cinema, give or take. Felt my brain disintegrate. The dream sequence\/video game, too. This moved me more than anything I’ve seen in years. Some of my favorite marriages of image… more","Likes":133},{"Reviewer":"davidehrlich","Rating":3.0,"Date":"2024-05-18","Content":"A searching and scattershot portrait of displacement that’s as likely to resonate with Jia Zhang-ke devotees as it is to mystify those who are new to his work, “Caught by the Tides” finds the Chinese auteur returning the most pivotal characters and locations that have defined his movies over the last two decades. Then again, perhaps it would be more accurate to say that he never left them.\nTracing the faintest contours of a scripted love story around the scaffolding… more","Likes":188},{"Reviewer":"Avalyn Wu","Rating":5.0,"Date":"2024-10-08","Content":"The subject position of Communist youth was not gender specific. Clinging to this position, young women like me sensed few gender constraints in our devotion to the revolution. Numerous young female leaders emerged on this island with eight farms. This cohort never believed in female inferiority and were free from social expectations of the roles of wife and mother. Femininity was not defined as performing the traditional roles of wife and mother. To be a good female youth was to…\nmore","Likes":166},{"Reviewer":"Jeff Zhang","Rating":5.0,"Date":"2024-10-10","Content":"Immense. The propulsive, unfeeling wake of China’s progress hand-in-hand with Jia’s entire career. Unprecedented formal daring wrapped in a singular, quiet Zhao Tao performance. Instant best of the year territory.","Likes":136},{"Reviewer":"atmartin","Rating":3.0,"Date":"2025-05-11","Content":"Not quite sure what to make of this. I decided to see this without reading anything about it, without even watching the trailer, and that was probably a mistake. For the first 30 minutes at least, there are no characters or story—just snippets of documentary-like footage, in various formats and aspect ratios, of China in the early 2000s, with no hints given as to how it all ties together. Occasionally a young Zhao Tao appears in one of the clips… more","Likes":82},{"Reviewer":"nick","Rating":5.0,"Date":"2024-10-25","Content":"Best film of 2024, and Jia Zhangke's career best.\nCaught by the Tides defies categorization, seamlessly blending archive footage from Jia’s earlier films (notably Unknown Pleasures and Still Life) with reenactments to craft a unique narrative. The film is an expansive, at times experimental journey through Jia's enduring universe, brought to life by Zhao Tao, who delivers one of her most naturalistic yet affecting performances. The addition of a gay subplot was unexpected but a refreshing touch that works surprisingly… more","Likes":109}]