[{"Reviewer":"zoë rose bryant","Rating":4.0,"Date":"2025-01-17","Content":"one of the most inspiring - yet simultaneously infuriating - portraits of courage and perseverance in the face of overwhelming cruelty and suppression i’ve ever seen. in absolute awe of shiori itō and her strength. a historic work.","Likes":797},{"Reviewer":"Terence Ang 洪偉凱","Rating":4.0,"Date":"2025-01-29","Content":"\"'I'm still here,' I wanted him to know.\"\nRest in piss, Shitzo Abe.","Likes":392},{"Reviewer":"André Grochovski","Rating":4.0,"Date":"2025-02-03","Content":"We always think of Japan as such an advanced country, and it is. But we don't realize how archaic they are in other aspects, such as how to approach sexual crimes. When these cases occur, society sees the victim as guilty, especially if they try to talk about it. It's crazy that this still happens.\nJournalist Shiori Itō faced everything and everyone by not staying quiet after being abused by a friend of the Japanese prime minister. She had enormous… more","Likes":354},{"Reviewer":"Kevflix And Chill","Rating":4.0,"Date":"2024-01-31","Content":"Sundance 2024\nShiori Itō takes it upon herself to investigate her own sexual assault by a high ranking government official, when the police (and essentially everyone else) are eager to dismiss her account. An investigative journalist by trade it’s fascinating to watch her process her own case at times as if she is external to the facts and circumstances, yet at other times you witness the gravity of her ordeal really hit her. Very similar in a lot of ways to… more","Likes":276},{"Reviewer":"Yogesh .","Rating":4.0,"Date":"2025-02-18","Content":"The phonecall with the Doorman...... Will stick with me forever.","Likes":271},{"Reviewer":"ash","Rating":5.0,"Date":"2024-08-13","Content":"Harrowing, infuriating, essential viewing.","Likes":258},{"Reviewer":"Barmilliv","Rating":4.0,"Date":"2025-02-01","Content":"Em 2015, Ito, uma estagiária de 26 anos na Thomson Reuters, encontrou-se com o renomado repórter de TV Noriyuki Yamaguchi para discutir questões profissionais. Após a conversa, ela alega ter sido drogada e levada contra sua vontade ao quarto de hotel dele, onde foi estuprada enquanto estava inconsciente. Quando denunciou o ocorrido, suas alegações foram rapidamente rejeitadas pela polícia, amparadas por uma legislação desatualizada que, até sua recente revisão, não reconhecia a falta de consentimento como critério central para caracterizar… more","Likes":254},{"Reviewer":"byshiela","Rating":4.5,"Date":"2024-01-25","Content":"\"I was 25 but now I'm 33.\"\nDespite going against the status quo, Shiori Ito never doubted her own truth. Her legacy continues to spark conversations - she is a remarkable figure of tenacity and courage.","Likes":246},{"Reviewer":"Penny_S","Rating":5.0,"Date":"2025-01-25","Content":null,"Likes":189},{"Reviewer":"Daniel","Rating":4.5,"Date":"2025-02-25","Content":"\"The typical expectation of a victim is to be sad and weak, to hide and be embarrassed. I had a problem with this norm.\"\nIn 2015, journalist Shiori Itō became a victim of sexual assault. The police ended their investigation since Japanese laws make prosecuting sex crimes difficult, and because her rapist is a high profile journalist with connections to the prime minister. In 2017, Itō decides to go public to force another investigation and change public discourse ...\nBlack… more","Likes":179},{"Reviewer":"Joe Lynch","Rating":4.0,"Date":"2025-02-03","Content":"There’s no one I want to win an Oscar more this year than Director Shiori Itô.\nAfter you experience her story, as personal as documentaries get, you will too. \nA heartbreaking triumph.","Likes":149},{"Reviewer":"Matt Neglia","Rating":4.0,"Date":"2024-01-27","Content":"BLACK BOX DIARIES is a daring & courageous feat of investigative journalism by Shiori Itō, looking into her own experience of sexual assault & the tenacious quest for truth within Japan's corrupt & archaic legal system. This profoundly personal account unfolds with gripping power, utilizing journal entries, riveting & infuriating twists, all presented in chronological order over several years to highlight the taxing toll this all took on her. But, as a result, her resilience shines through and it’s inspiring to witness. A harrowing but important & impactful film.","Likes":137}]